# Definição de Tipos no Pandas

In [100]:
import pandas as pd
import numpy as np
from io import StringIO

dados = '''
joao, 2000-02-11, 28, 2, 87.1234
maria, 2003-01-21, 27, 3, 45.1256
'''

df0 = pd.read_csv(StringIO(dados), header=None)
print(df0.dtypes)

df1 = pd.read_csv(StringIO(dados), header=None, 
                  dtype={0:str, 1:np.object, 2:int, 3:np.int32, 4:np.float32}, 
                  parse_dates=[1])
print(df1.dtypes)

0     object
1     object
2      int64
3      int64
4    float64
dtype: object
0            object
1    datetime64[ns]
2             int64
3             int32
4           float32
dtype: object

In [98]:
df0

       0            1   2  3        4
0   joao   2000-02-11  28  2  87.1234
1  maria   2003-01-21  27  3  45.1256

In [99]:
df1

       0          1   2  3          4
0   joao 2000-02-11  28  2  87.123398
1  maria 2003-01-21  27  3  45.125599